/*
*	ファイル名	：	stage.cpp
*	製作者		：	丸山洋一郎
*	制作日		：	2015/05/28
*	内容		：	ゲームの実行時の親クラス。
*					ゲーム開始前の先攻後攻などやゲーム中の部分などを切り替える予定
*					ぶっちゃけ無くて良いんじゃない感が漂うクラス					
*/

#include "stage.h"
#include "rule.h"

#include <memory>
#include <string>




namespace game
{
	//**************************************************************************************//
	//作成するプログラムで必要となる変数、定数定義
	//**************************************************************************************//


	//**************************************************************************************//
	//関数記述
	//**************************************************************************************//



	//**************************************************************************************//
	//デフォルト関数
	//**************************************************************************************//

	CSceneStage::CSceneStage(const std::string& objectName)
		:
		Object(objectName)
	{

	}
	void CSceneStage::init()
	{
		insertAsChild(new Rule("rule"));

	}
	void CSceneStage::render()
	{
		//デバッグ用
#ifdef _DEBUG
		gplib::graph::Draw_2DClear();

		gplib::graph::Draw_2DRefresh();
#endif

	}
	void CSceneStage::update()
	{


	}
}


